---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundaries
source: html/9d64e2ab-eac5-24b5-e175-e852ef5c86bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundaries Property

Stairs require no more than two boundaries (chains of one or more Boundary Lines).

## Syntax (C#)
```csharp
public static FailureDefinitionId StairTooManyConnectedBoundaries { get; }
```